YINGFENG001/TTC_stm32f4/User/stepper/bsp_stepper_T_speed.h
#ifndef __BSP_STEPPER_T_SPEED_H
#define	__BSP_STEPPER_T_SPEED_H

#include "stm32f4xx.h"
#include "./stepper/bsp_stepper_init.h"
#include "math.h"

/* 单台步进电机的梯形加减速运行参数 */
typedef struct {
  uint8_t run_state; /* 当前运行状态：STOP/ACCEL/DECEL/RUN */
  uint8_t dir;       /* 当前方向：CW/CCW */
  uint8_t continuous;
  uint8_t speed_update_pending;
  uint8_t target_dir;
  uint8_t stop_on_target;
  unsigned int step_delay;     /* 下一次比较事件的延时周期 */
  unsigned int decel_start;    /* 开始进入减速段的步数位置 */
  signed int decel_val;        /* 减速段补偿值 */
  signed int min_delay;        /* 匀速段最小延时，对应最大速度 */
  signed int accel_count;      /* 加减速段计数器 */
  unsigned int target_min_delay;
  unsigned int target_speed;
  unsigned int target_accel;
  unsigned int target_decel;
  signed int current_speed_q16;
  signed int target_speed_q16;
} speedRampData;

/* 系统级状态标志 */
struct GLOBAL_FLAGS {
  volatile uint8_t running; /* 当前是否存在任意电机正在运行 */
  volatile uint8_t cmd;     /* 保留字段，串口命令已改为双缓冲 */
  volatile uint8_t out_ena; /* 驱动器输出是否使能 */
};

typedef struct {
  int32_t position_steps;
  uint8_t running;
  uint8_t out_ena;
  uint8_t dir;
  uint8_t continuous;
  uint8_t run_state;
} StepperRuntimeSnapshot;

typedef enum {
  STEPPER_CMD_OK = 0,
  STEPPER_CMD_BUSY,
  STEPPER_CMD_DISABLED,
  STEPPER_CMD_ID_ERROR,
  STEPPER_CMD_PARAM_ERROR
} StepperCmdResult;

#define FALSE             0
#define TRUE              1
#define CW                0 // 顺时针
#define CCW               1 // 逆时针

#define STOP              0 // 停止状态
#define ACCEL             1 // 加速状态
#define DECEL             2 // 减速状态
#define RUN               3 // 匀速状态
#define SPEED_ACCEL       4 // 连续运行动态升速状态
#define SPEED_DECEL       5 // 连续运行动态降速状态

/*频率相关参数*/
#define TIM_PRESCALER      31
#define T1_FREQ           (SystemCoreClock/(TIM_PRESCALER+1))
#define T1_FREQ_148       ((float)((T1_FREQ*0.676)/10))

/* 默认值仅用于上电初始化，实际运行参数由各设备单独下发 */
#define STEPPER_DEFAULT_PULSES_PER_REV  6400U

extern volatile speedRampData srd[STEPPER_NUM];
extern volatile int stepPosition[STEPPER_NUM];
extern volatile struct GLOBAL_FLAGS status;
extern volatile struct GLOBAL_FLAGS motor_status[STEPPER_NUM];

void speed_decision(uint8_t motor_id);
void MSD_ENA(FunctionalState NewState);
void Stepper_SetMotorPulsesPerRev(uint8_t motor_id, uint32_t pulses_per_rev);
StepperCmdResult stepper_move_T(uint8_t motor_id, int32_t step, uint32_t accel, uint32_t decel, uint32_t speed);
StepperCmdResult Stepper_RunContinuous(uint8_t motor_id, uint8_t dir, uint32_t accel, uint32_t speed);
StepperCmdResult Stepper_UpdateRunningSpeed(uint8_t motor_id, uint32_t accel, uint32_t decel, uint32_t speed);
StepperCmdResult Stepper_UpdateContinuousSpeedSigned(uint8_t motor_id, uint8_t dir, uint8_t stop, uint32_t accel, uint32_t decel, uint32_t speed);
StepperCmdResult Stepper_Stop(uint8_t motor_id);
uint8_t Stepper_IsAnyRunning(void);
uint8_t Stepper_GetRuntimeSnapshot(uint8_t motor_id, StepperRuntimeSnapshot *snapshot);

#endif
